m/app/Controllers/Cadastros.php

INSERT INTO `imovel` (`Tipo`, `Preco`, `Area`, `NumeroQuartos`, `NumeroBanheiros`, `NumeroVagasGaragem`, `Imagens`, `ID_Proprietario`, `ID_Endereco`) VALUES ('Casa', '500', '80', '3', '1', '1', NULL, NULL, NULL)
---
    public function DadosImoveis()
    {
        $tipo = $this->request->getPost('tipo_imovel');
        $preco = $this->request->getPost('preco');
        $area = $this->request->getPost('area_total');
        $numeroQuartos = $this->request->getPost('num_quartos');
        $numeroBanheiros = $this->request->getPost('num_banheiros');
        $numeroVagasGaragem = $this->request->getPost('num_vagas_garagem');
        $imagens = $this->request->getPost('Imagens');
        $idProprietario = $this->request->getPost('ID_proprietario');
        $idEndereco = $this->request->getPost('ID_endereco');

        $imovelData = [
            'Tipo' => $tipo,
            'Preco' => $preco,
            'Area' => $area,
            'NumeroQuartos' => $numeroQuartos,
            'NumeroBanheiros' => $numeroBanheiros,
            'NumeroVagasGaragem' => $numeroVagasGaragem,
            'Imagens' => $imagens,
            'ID_Proprietario' => $idProprietario,
            'ID_Endereco' => $idEndereco
        ];
        $imovelModel = new \App\Models\ImovelModel();
        $imovelModel->insert($imovelData);

INSERT INTO `proprietario` (`Nome`, `Email`, `Telefone`) VALUES ('Marco Antônio', 'marco.antonio@example.zem', '33 99998888')
---
            'Telefone' => $telefoneProprietario
            ];
        $proprietarioModel = new \App\Models\proprietarioModel();
        $idProprietario = $proprietarioModel->insert($proprietarioData);

INSERT INTO `endereco` (`Rua`, `Bairro`, `Cidade`, `Estado`, `CEP`) VALUES ('Rua das Flores ', 'Porto', 'Araçuaí', 'Minas Gerais', '39600000')
---
            'CEP' => $Cep
            ];
        $enderecoModel = new \App\Models\enderecoModel();
        $idEndereco = $enderecoModel->insert($enderecoData);