app/Controllers/Cadastros.php

            'Imagens' => $imgName
        ];

        $imovelModel->insert($imovelData);
---
INSERT INTO `imovel` (`Usuario`, `Tipo`, `Aluguel_Venda`, `Preco`, `Area`, `NumeroQuartos`, `NumeroBanheiros`, `NumeroVagasGaragem`, `Imagens`) VALUES ('adm', 'casa', 'venda', '500', '400', '2', '2', '2', '1699993645_137aff00509965604aac.jpg')



        $proprietarioModel = new \App\Models\proprietarioModel();
        $proprietarioModel->insert($proprietarioData);
---
INSERT INTO `proprietario` (`Nome`, `Email`, `Telefone`) VALUES ('442', '4222@dffdsdsfdsf', '33990000000')

        //Relacionando com o imóvel
        $imovelModel->set('ID_Proprietario', $ID_Proprietario[$QtdProprietarios]);
        $imovelModel->where('ID_imovel', $imovel[$qtdImovel]['ID_imovel']);
        $imovelModel->update();
---
UPDATE `imovel` SET `ID_Proprietario` = ('70')
WHERE `ID_imovel` = '4'

            ];

         $enderecoModel = new \App\Models\enderecoModel();
         $enderecoModel->insert($enderecoData);
---
INSERT INTO `endereco` (`Rua`, `numImovel`, `Bairro`, `Cidade`, `Estado`, `CEP`) VALUES ('sasas', '111', 'ghhkj', 'Araçuaí', 'MG', '39600-000')


        $imovelModel->set('ID_Endereco', $Endereco_ID[$qtdEndereco]);
        $imovelModel->where('ID_imovel', $imovel[$qtdImovel]['ID_imovel']);
        $imovelModel->update();
---
UPDATE `imovel` SET `ID_Endereco` = ('49')
WHERE `ID_imovel` = '4'

    public function getImoveisByUsuario($usuario)
    {
        $imovelModel = new \App\Models\ImovelModel();
        $imoveis = $imovelModel->where('Usuario', $usuario)->findAll();
---
SELECT *
FROM `imovel`
WHERE `Usuario` = 'adm'