app/Models/enderecoModel.php

    public function getIdEndereco ($rua,$numImovel){


        $query = $this->db->table('endereco')->select('ID_Endereco')->where('Rua', $rua)->where('numImovel', $numImovel)->get();
---
SELECT `ID_Endereco`
FROM `endereco`
WHERE `Rua` = 'sasas'
AND `numImovel` = '111'

    public function getEnderecos($rua,$numImovel){

        $query = $this->db->table('endereco')->where('Rua', $rua)->where('numImovel', $numImovel)->get();
---
SELECT *
FROM `endereco`
WHERE `Rua` = 'sasas'
AND `numImovel` = '111'