app/Models/imovelModel.php

SELECT *
FROM `imovel`
---
    public function getimovel (){

        //$query = $this->db->query('select * from clientes;');

        $query = $this->db->table('imovel')->get();

SELECT *
FROM `imovel`
WHERE `ID_imovel` = '4'
---
    public function getimovelByID ($id){

        $query = $this->db->table('imovel')->where('ID_imovel', $id)->get();