app/Models/proprietarioModel.php

    public function getIdProprietario ($nome,$email){


        $query = $this->db->table('proprietario')->select('ID_proprietario')->where('nome', $nome)->where('email', $email)->get();
---
SELECT `ID_proprietario`
FROM `proprietario`
WHERE `nome` = '442'
AND `email` = '4222@dffdsdsfdsf'

    public function getProprietarios($nome,$email){

        $query = $this->db->table('proprietario')->where('nome', $nome)->where('email', $email)->get();
---
SELECT *
FROM `proprietario`
WHERE `nome` = '442'
AND `email` = '4222@dffdsdsfdsf'