app/Models/UsuarioModel.php

    public function getUsuarios ($usuario){

        $query = $this->db->table('usuario')->where('usuario', $usuario)->get();
---
SELECT *
FROM `usuario`
WHERE `usuario` = 'marco.antonio'